MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256GM604/mcu.h
/* AD2CSSH */
/* Bitname _CSS16 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS17 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS18 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS19 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS20 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS21 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS22 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS23 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS24 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS25 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS26 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS27 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS28 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS29 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS30 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS31 cannot be defined because it is used by more than one SFR */

/* AD2CSSL */
/* Bitname _CSS0 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS1 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS2 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS3 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS4 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS5 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS6 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS7 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS8 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS9 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS10 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS11 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS12 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS13 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS14 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS15 cannot be defined because it is used by more than one SFR */

/* AD2CON4 */
/* Bitname _DMABL cannot be defined because it is used by more than one SFR */
/* Bitname _ADDMAEN cannot be defined because it is used by more than one SFR */
/* Bitname _DMABL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABL2 cannot be defined because it is used by more than one SFR */

/* C1CTRL1 */
/* Bitname _WIN cannot be defined because it is used by more than one SFR */
/* Bitname _CANCAP cannot be defined because it is used by more than one SFR */
/* Bitname _OPMODE cannot be defined because it is used by more than one SFR */
/* Bitname _REQOP cannot be defined because it is used by more than one SFR */
/* Bitname _CANCKS cannot be defined because it is used by more than one SFR */
/* Bitname _ABAT cannot be defined because it is used by more than one SFR */
/* Bitname _CSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _OPMODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _OPMODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _OPMODE2 cannot be defined because it is used by more than one SFR */
/* Bitname _REQOP0 cannot be defined because it is used by more than one SFR */
/* Bitname _REQOP1 cannot be defined because it is used by more than one SFR */
/* Bitname _REQOP2 cannot be defined because it is used by more than one SFR */

/* C1CTRL2 */
/* Bitname _DNCNT cannot be defined because it is used by more than one SFR */
/* Bitname _DNCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _DNCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _DNCNT2 cannot be defined because it is used by more than one SFR */
/* Bitname _DNCNT3 cannot be defined because it is used by more than one SFR */
/* Bitname _DNCNT4 cannot be defined because it is used by more than one SFR */

/* C1VEC */
/* Bitname _ICODE cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE2 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE3 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE4 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE5 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE6 cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT0 cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT2 cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT3 cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT4 cannot be defined because it is used by more than one SFR */

/* C1FCTRL */
/* Bitname _FSA cannot be defined because it is used by more than one SFR */
/* Bitname _DMABS cannot be defined because it is used by more than one SFR */
/* Bitname _FSA0 cannot be defined because it is used by more than one SFR */
/* Bitname _FSA1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSA2 cannot be defined because it is used by more than one SFR */
/* Bitname _FSA3 cannot be defined because it is used by more than one SFR */
/* Bitname _FSA4 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABS0 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABS2 cannot be defined because it is used by more than one SFR */

