MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256GM604/mcu.h
#define _AD2CHS0_CH0SB_POSITION                  0x00000008
#define _AD2CHS0_CH0SB_MASK                      0x00003F00
#define _AD2CHS0_CH0SB_LENGTH                    0x00000006

#define _AD2CHS0_CH0NB_POSITION                  0x0000000F
#define _AD2CHS0_CH0NB_MASK                      0x00008000
#define _AD2CHS0_CH0NB_LENGTH                    0x00000001

#define _AD2CHS0_CH0SA0_POSITION                 0x00000000
#define _AD2CHS0_CH0SA0_MASK                     0x00000001
#define _AD2CHS0_CH0SA0_LENGTH                   0x00000001

#define _AD2CHS0_CH0SA1_POSITION                 0x00000001
#define _AD2CHS0_CH0SA1_MASK                     0x00000002
#define _AD2CHS0_CH0SA1_LENGTH                   0x00000001

#define _AD2CHS0_CH0SA2_POSITION                 0x00000002
#define _AD2CHS0_CH0SA2_MASK                     0x00000004
#define _AD2CHS0_CH0SA2_LENGTH                   0x00000001

#define _AD2CHS0_CH0SA3_POSITION                 0x00000003
#define _AD2CHS0_CH0SA3_MASK                     0x00000008
#define _AD2CHS0_CH0SA3_LENGTH                   0x00000001

#define _AD2CHS0_CH0SA4_POSITION                 0x00000004
#define _AD2CHS0_CH0SA4_MASK                     0x00000010
#define _AD2CHS0_CH0SA4_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB0_POSITION                 0x00000008
#define _AD2CHS0_CH0SB0_MASK                     0x00000100
#define _AD2CHS0_CH0SB0_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB1_POSITION                 0x00000009
#define _AD2CHS0_CH0SB1_MASK                     0x00000200
#define _AD2CHS0_CH0SB1_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB2_POSITION                 0x0000000A
#define _AD2CHS0_CH0SB2_MASK                     0x00000400
#define _AD2CHS0_CH0SB2_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB3_POSITION                 0x0000000B
#define _AD2CHS0_CH0SB3_MASK                     0x00000800
#define _AD2CHS0_CH0SB3_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB4_POSITION                 0x0000000C
#define _AD2CHS0_CH0SB4_MASK                     0x00001000
#define _AD2CHS0_CH0SB4_LENGTH                   0x00000001

#define _AD2CSSH_CSS16_POSITION                  0x00000000
#define _AD2CSSH_CSS16_MASK                      0x00000001
#define _AD2CSSH_CSS16_LENGTH                    0x00000001

#define _AD2CSSH_CSS17_POSITION                  0x00000001
#define _AD2CSSH_CSS17_MASK                      0x00000002
#define _AD2CSSH_CSS17_LENGTH                    0x00000001

#define _AD2CSSH_CSS18_POSITION                  0x00000002
#define _AD2CSSH_CSS18_MASK                      0x00000004
#define _AD2CSSH_CSS18_LENGTH                    0x00000001

#define _AD2CSSH_CSS19_POSITION                  0x00000003
#define _AD2CSSH_CSS19_MASK                      0x00000008
#define _AD2CSSH_CSS19_LENGTH                    0x00000001

#define _AD2CSSH_CSS20_POSITION                  0x00000004
#define _AD2CSSH_CSS20_MASK                      0x00000010
#define _AD2CSSH_CSS20_LENGTH                    0x00000001

#define _AD2CSSH_CSS21_POSITION                  0x00000005
#define _AD2CSSH_CSS21_MASK                      0x00000020
#define _AD2CSSH_CSS21_LENGTH                    0x00000001

#define _AD2CSSH_CSS22_POSITION                  0x00000006
#define _AD2CSSH_CSS22_MASK                      0x00000040
#define _AD2CSSH_CSS22_LENGTH                    0x00000001

#define _AD2CSSH_CSS23_POSITION                  0x00000007
#define _AD2CSSH_CSS23_MASK                      0x00000080
#define _AD2CSSH_CSS23_LENGTH                    0x00000001

#define _AD2CSSH_CSS24_POSITION                  0x00000008
#define _AD2CSSH_CSS24_MASK                      0x00000100
#define _AD2CSSH_CSS24_LENGTH                    0x00000001

#define _AD2CSSH_CSS25_POSITION                  0x00000009
#define _AD2CSSH_CSS25_MASK                      0x00000200
#define _AD2CSSH_CSS25_LENGTH                    0x00000001

#define _AD2CSSH_CSS26_POSITION                  0x0000000A
#define _AD2CSSH_CSS26_MASK                      0x00000400
#define _AD2CSSH_CSS26_LENGTH                    0x00000001

#define _AD2CSSH_CSS27_POSITION                  0x0000000B
#define _AD2CSSH_CSS27_MASK                      0x00000800
#define _AD2CSSH_CSS27_LENGTH                    0x00000001

#define _AD2CSSH_CSS28_POSITION                  0x0000000C
#define _AD2CSSH_CSS28_MASK                      0x00001000
#define _AD2CSSH_CSS28_LENGTH                    0x00000001

#define _AD2CSSH_CSS29_POSITION                  0x0000000D
#define _AD2CSSH_CSS29_MASK                      0x00002000
#define _AD2CSSH_CSS29_LENGTH                    0x00000001

#define _AD2CSSH_CSS30_POSITION                  0x0000000E
#define _AD2CSSH_CSS30_MASK                      0x00004000
#define _AD2CSSH_CSS30_LENGTH                    0x00000001

#define _AD2CSSH_CSS31_POSITION                  0x0000000F
#define _AD2CSSH_CSS31_MASK                      0x00008000
#define _AD2CSSH_CSS31_LENGTH                    0x00000001

#define _AD2CSSL_CSS0_POSITION                   0x00000000
#define _AD2CSSL_CSS0_MASK                       0x00000001
#define _AD2CSSL_CSS0_LENGTH                     0x00000001

#define _AD2CSSL_CSS1_POSITION                   0x00000001
#define _AD2CSSL_CSS1_MASK                       0x00000002
#define _AD2CSSL_CSS1_LENGTH                     0x00000001

#define _AD2CSSL_CSS2_POSITION                   0x00000002
#define _AD2CSSL_CSS2_MASK                       0x00000004
#define _AD2CSSL_CSS2_LENGTH                     0x00000001

#define _AD2CSSL_CSS3_POSITION                   0x00000003
#define _AD2CSSL_CSS3_MASK                       0x00000008
#define _AD2CSSL_CSS3_LENGTH                     0x00000001

#define _AD2CSSL_CSS4_POSITION                   0x00000004
#define _AD2CSSL_CSS4_MASK                       0x00000010
#define _AD2CSSL_CSS4_LENGTH                     0x00000001

#define _AD2CSSL_CSS5_POSITION                   0x00000005
#define _AD2CSSL_CSS5_MASK                       0x00000020
#define _AD2CSSL_CSS5_LENGTH                     0x00000001

